# St7GetBeamNRef

Returns whether the reference node is shown in the display of beam3 elements.

Beam Entity Display

long St7GetBeamNRef(long uID, bool* Show)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

Show

The state of the Show NRef option; either True or False.